import React from 'react';
import './Blogs.css'

const Blogs = () => {
    return (
        <div className='blogs-container'>
            <h2>What is Context API?</h2>
            <p>Context প্রতিটি স্তরে ম্যানুয়ালি props ডাউন না করে কম্পোনেন্ট ট্রির মাধ্যমে ডেটা পাস করার অনুমতি দেয়।
                <br />
                React application এ, আমরা প্রপসের মাধ্যমে টপ-ডাউন পদ্ধতিতে ডেটা পাস করেছি। কখনও কখনও এটি কিছু নির্দিষ্ট ধরণের প্রপসের জন্য অসুবিধাজনক যা React application এর অনেক উপাদানের জন্য প্রয়োজনীয়। প্রসঙ্গটি উপাদান গাছের প্রতিটি স্তরের মধ্য দিয়ে স্পষ্টভাবে একটি প্রপ পাস না করে উপাদানগুলির মধ্যে মানগুলি পাস করার একটি উপায় সরবরাহ করে।</p>
            <h2>What is Semantic tag?</h2>
            <p>এইচটিএমএল ট্যাগগুলি (বেশিরভাগ) সামগ্রী format করতে ব্যবহৃত হয় - এই ট্যাগগুলি ব্রাউজারকে বলে যে কীভাবে পৃষ্ঠায় সামগ্রী প্রদর্শন করতে হয়। তারা কোন ধরনের বিষয়বস্তু ধারণ করে বা পৃষ্ঠায় সেই বিষয়বস্তুটি কী ভূমিকা পালন করে তার কোন ইঙ্গিত দেয় না।
                <br />
                Semantic HTML5 নির্দিষ্ট ট্যাগগুলিকে সংজ্ঞায়িত করে এই ত্রুটির সমাধান করে যাতে স্পষ্টভাবে বোঝা যায় যে এই ট্যাগগুলিতে থাকা বিষয়বস্তুর দ্বারা কী ভূমিকা পালন করা হয়৷ এই সুস্পষ্ট তথ্যটি Google এবং Bing-এর মতো রোবট/ক্রলারকে কোন বিষয়বস্তু গুরুত্বপূর্ণ, কোনটি একটি সহায়ক, কোনটি নেভিগেশনের জন্য ইত্যাদি আরও ভালভাবে বুঝতে সাহায্য করে৷</p>
            <h2>What is the difference between inline, block and inline-block elements?
            </h2>
            <p>Inline: ইনলাইন উপাদানগুলি আক্ষরিক অর্থে একটি একক লাইনে বিভিন্ন ইনলাইন বা ইনলাইন-ব্লক উপাদানগুলির পাশাপাশি পাশাপাশি স্থাপন করা হয়।</p>
            <p>Block: ব্লক উপাদান সবসময় একটি নতুন লাইনে শুরু হয়। তারা একটি সম্পূর্ণ সারি বা প্রস্থের স্থানও নেবে। এর মানে হল যে অন্য কোন HTML উপাদান থাকতে পারে না যা ব্লক স্তরের উপাদানগুলির সাথে পাশাপাশি দাঁড়াতে পারে।</p>
            <p>Inline-Block: ইনলাইন ব্লকগুলি ইনলাইন উপাদানগুলির মতো প্রকৃতিতে খুব অনুরূপ। তারা ইনলাইন যা করে তা করতে পারে তবে কিছু প্রস্থ, উচ্চতা এবং উল্লম্ব মার্জিনও সেট করা যেতে পারে!</p>
            <table className='difference-table'>
                <tr>
                    <th></th>
                    <th>Inline</th>
                    <th>Inline-Block</th>
                    <th>Block</th>
                </tr>
                <tr>
                    <td>New line</td>
                    <td>No</td>
                    <td>No</td>
                    <td>Yes</td>
                </tr>
                <tr>
                    <td>Side By Side</td>
                    <td>Yes</td>
                    <td>Yes</td>
                    <td>No</td>
                </tr>
                <tr>
                    <td>Width/height, margin</td>
                    <td>No</td>
                    <td>Yes</td>
                    <td>Yes</td>
                </tr>
                <tr>
                    <td>Can contain</td>
                    <td>No</td>
                    <td>Inline</td>
                    <td>Inline, Inline-Block and Block</td>
                </tr>

            </table>
        </div>
    );
};

export default Blogs;